# Задача А
print('Введите три целых числа:')
z1 = int(input('Первое число:'))
z2 = int(input('Второе число:'))
z3 = int(input('Третье число:'))

print(f'Сумма трёх чисел равна: {z1}+{z2}+{z3} = {z1+z2+z3}')
print(f'Произведение трёх чисел равно: {z1}*{z2}*{z3} = {z1*z2*z3}')
print(f'Среднее арифметическое равно: ({z1}+{z2}+{z3})/3 = {(z1+z2+z3)/3}')

