"""
6.	Пользователь вводит число и степень. Программа вычисляет указанную степень этого числа.
"""
n1 = int(input('Введите число А:'))
n2 = int(input('Введите степень n, в которую нужно возвести число А:'))
print(f'Число {n1} в степени {n2} равно: {n1**n2}')

