"""
4.	Написать программу, которая находит среднее арифметическое значение трёх вещественных чисел.
"""

print('Введите три вещественных числа:')
f1 = float(input('Первое число:'))
f2 = float(input('Второе число:'))
f3 = float(input('Третье число:'))

print(f'Среднее арифметическое равно: ({f1}+{f2}+{f3})/3 = {(f1+f2+f3)/3:.02f}')