"""
9.	Написать программу, которая переводит километры в сухопутные и морские мили.
"""
f1 = float(input('Введите число километров:'))
print(f'{f1} км  это {f1/1.609:.02f} сух. миль и {f1/1.852:.02f} мор. миль')
